Revit 2027 API
IFCExportOptions.FilterViewId Property
 Id of the view whose visibility settings will govern the contents in the exported IFC file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FilterViewId { get; set; }
Public Property FilterViewId As ElementId
	Get
	Set
public:
property ElementId^ FilterViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member FilterViewId : ElementId with get, set
Property Value
ElementId
 This should be set to the id of the view, or InvalidElementId if there is to be no special filtering applied (all model elements will be exported). Default is InvalidElementId.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCExportOptions Class
Autodesk.Revit.DB Namespace